
#include "planck.h"
#include "action_layer.h"
#include "keymap_nordic.h"
#include "keymap_swedish.h"

#define CS_TABFN LT(_FUNCTION, KC_TAB)
#define CS_ERAISE LT(RAISE, KC_ENT)

// Tap for enter, hold for RCTRL
#define CS_ECTRL MT(MOD_RCTL, KC_ENT)

extern keymap_config_t keymap_config;

enum planck_layers {
  _QWERTY,
  _LOWER,
  _RAISE,
  _FUNCTION,
  _ADJUST
};

enum planck_keycodes {
  QWERTY,
  LOWER,
  RAISE,
  FUNCTION,
  ADJUST,

  // TABLFLP,  //  (ノಠ益ಠ)ノ彡┻━┻   (╯°□°）╯︵ ┻━┻
  // TALBBAK,  //  ┬──┬ ノ( ゜-゜ノ)
  // LENNY,    //  ( ͡° ͜ʖ ͡°)
  // SHRUG,    //  ¯\_(ツ)_/¯
  // LOOK,     //   ಠ_ಠ
};

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

/* Qwerty
 * ,-----------------------------------------------------------------------------------.
 * | Esc  |   Q  |   W  |   E  |   R  |   T  |   Y  |   U  |   I  |   O  |   P  |   Å  |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |Tab/fn|   A  |   S  |   D  |   F  |   G  |   H  |   J  |   K  |   L  |   Ö  |   Ä  |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * | Shift|   Z  |   X  |   C  |   V  |   B  |   N  |   M  |   ,  |   .  |  Up  |Enter |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * | Ctrl | GUI  | Alt  | Ctrl |Lower | Bksp | Space| Raise| ECtrl| Left | Down |Right |
 * `-----------------------------------------------------------------------------------'
 */
[_QWERTY] = {
  {KC_ESC,   KC_Q,    KC_W,    KC_E,    KC_R,    KC_T,    KC_Y,    KC_U,  KC_I,    KC_O,    KC_P,     SE_ARNG  },
  {CS_TABFN, KC_A,    KC_S,    KC_D,    KC_F,    KC_G,    KC_H,    KC_J,  KC_K,    KC_L,    SE_ODIA,  SE_ADIA  },
  {KC_LSFT,  KC_Z,    KC_X,    KC_C,    KC_V,    KC_B,    KC_N,    KC_M,  KC_COMM, KC_DOT,  KC_UP,    KC_ENT },
  {KC_LCTL,  KC_LGUI, KC_LALT, KC_LCTL, LOWER,   KC_BSPC, KC_SPC,  RAISE, CS_ECTRL, KC_LEFT, KC_DOWN, KC_RGHT}
},

/* Lower
 * ,-----------------------------------------------------------------------------------.
 * |      |      |   "  |   ?  |   !  |   ~  |   %  |   7  |   8  |   9  |   +  |  -   |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |      |      |   #  |   &  |   |  |   ^  |   $  |   4  |   5  |   6  |   *  |  /   |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * |      |      |  F12 |   @  |   /  |   \  |   =  |   1  |   2  |   3  |      |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |   0  |      |      |      |
 * `-----------------------------------------------------------------------------------'
 */
[_LOWER] = {
  {_______, _______, SE_QUO2, SE_QUES, SE_EXLM, NO_TILD, SE_PERC, KC_7,    KC_8, KC_9,    SE_PLUS, SE_MINS},
  {_______, _______, SE_HASH, SE_AMPR, SE_PIPE, NO_CIRC, SE_DLR,  KC_4,    KC_5, KC_6,    SE_ASTR, SE_SLSH},
  {_______, _______, KC_F12,  SE_AT,   SE_SLSH, SE_BSLS, SE_EQL,  KC_1,    KC_2, KC_3,    _______, _______},
  {_______, _______, _______, _______, _______, _______, _______, _______, KC_0, _______, _______, _______}
},


/* Raise
 * ,----------------------------------------------------------------------------------.
 * |      |  F7  |  F8  |  F9  | F10  | F11  | F12  |   {  |   }  |   <  |   >  |      |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |      |  F4  |  F5  |  F6  |SHRUG | LOOK |LENNY |   [  |   ]  |   '  |   `  |  ´   |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * |      |  F1  |  F2  |  F3  |  TF  |  TB  |      |   (  |   )  |      |      |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |      |      |  DEL |      |      |      |      |      |      |
 * `-----------------------------------------------------------------------------------'
 */
[_RAISE] = {
  {_______, KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12,  SE_LCBR, SE_RCBR, SE_LABK, SE_RABK,   _______},
  {_______, KC_F4,   KC_F5,   KC_F6,   _______,   _______,    _______,   SE_LBRC, SE_RBRC, KC_BSLS, S(KC_EQL), KC_EQL },
  {_______, KC_F1,   KC_F2,   KC_F3,   _______, _______, _______, SE_LPRN, SE_RPRN, _______, _______,   _______},
  {_______, _______, _______, _______, _______, KC_DEL,  _______, _______, _______, _______, _______,   _______}
},

// [_RAISE] = {
//   {_______, KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12,  SE_LCBR, SE_RCBR, SE_LABK, SE_RABK,   _______},
//   {_______, KC_F4,   KC_F5,   KC_F6,   SHRUG,   LOOK,    LENNY,   SE_LBRC, SE_RBRC, KC_BSLS, S(KC_EQL), KC_EQL },
//   {_______, KC_F1,   KC_F2,   KC_F3,   TABLFLP, TALBBAK, _______, SE_LPRN, SE_RPRN, _______, _______,   _______},
//   {_______, _______, _______, _______, _______, KC_DEL,  _______, _______, _______, _______, _______,   _______}
// },


/* FUNCTION
 * ,----------------------------------------------------------------------------------.
 * |      | Vol- | Vol+ | Mute |      |      |      |      |  UP  |      |      |      |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |      | Prev | PlPa | Next |      |      |      | LEFT | DOWN | RIGHT|      |      |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * |      |  BL- |  BL+ | BLTG |      |      |      |      |      |      |      |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * `-----------------------------------------------------------------------------------'
 */
[_FUNCTION] = {
  {_______, KC_VOLD, KC_VOLU, KC__MUTE, _______, _______, _______, _______, KC_UP,   _______, _______, _______},
  {_______, KC_MPRV, KC_MPLY, KC_MNXT,  _______, _______, _______, KC_LEFT, KC_DOWN, KC_RGHT, _______, _______},
  {_______, BL_DEC,  BL_INC,  BL_TOGG,  _______, _______, _______, _______, _______, _______, _______, _______},
  {_______, _______, _______, _______,  _______, _______, _______, _______, _______, _______, _______, _______}
},


/* Adjust (Lower + Raise)
 * ,-----------------------------------------------------------------------------------.
 * |      | Reset|      |      |      |      |      |      |      |      |      |  Del |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |      |      |      |Aud on|Audoff|AGnorm|AGswap|Qwerty|Colemk|Dvorak|Plover|      |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * |      |Voice-|Voice+|Mus on|Musoff|MIDIon|MIDIof|      |      |      |      |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * `-----------------------------------------------------------------------------------'
 */
[_ADJUST] = {
  {_______, RESET,   DEBUG,    RGB_TOG, RGB_MOD, RGB_HUI, RGB_HUD, RGB_SAI, RGB_SAD, RGB_VAI, RGB_VAD, KC_DEL },
  {_______, _______, MU_MOD,  AU_ON,   AU_OFF,  AG_NORM, AG_SWAP, QWERTY,  _______, _______,  _______,  _______},
  {_______, MUV_DE,  MUV_IN,  MU_ON,   MU_OFF,  MI_ON,   MI_OFF,  TERM_ON, TERM_OFF, _______, _______, _______},
  {_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______}
}
};

// #ifdef AUDIO_ENABLE
//   float plover_song[][2]     = SONG(PLOVER_SOUND);
//   float plover_gb_song[][2]  = SONG(PLOVER_GOODBYE_SOUND);
// #endif

bool process_record_user(uint16_t keycode, keyrecord_t *record) {
  switch (keycode) {
    case QWERTY:
      if (record->event.pressed) {
        set_single_persistent_default_layer(_QWERTY);
      }
      return false;
      break;
    case LOWER:
      if (record->event.pressed) {
        layer_on(_LOWER);
        update_tri_layer(_LOWER, _RAISE, _ADJUST);
      } else {
        layer_off(_LOWER);
        update_tri_layer(_LOWER, _RAISE, _ADJUST);
      }
      return false;
      break;
    case RAISE:
      if (record->event.pressed) {
        layer_on(_RAISE);
        update_tri_layer(_LOWER, _RAISE, _ADJUST);
      } else {
        layer_off(_RAISE);
        update_tri_layer(_LOWER, _RAISE, _ADJUST);
      }
      return false;
      break;

   // case TABLFLP:
   //   if (record->event.pressed) {
   //     send_unicode_string("(╯°□°）╯︵ ┻━┻");
   //   }
   //   break;
//
   // case TALBBAK:
   //   if (record->event.pressed) {
   //     send_unicode_string("┬──┬ ノ( ゜-゜ノ)");
   //   }
   //   break;
//
   // case LENNY:
   //   if (record->event.pressed) {
   //     send_unicode_string("( ͡° ͜ʖ ͡°)");
   //   }
   //   break;
//
   // case SHRUG:
   //   if (record->event.pressed) {
   //     send_unicode_string("¯\\_(ツ)_/¯");
   //   }
   //   break;
//
   // case LOOK:
   //   if (record->event.pressed) {
   //     send_unicode_string("ಠ_ಠ");
   //   }
   //   break;
  }
  return true;
}


/* FUNCTION
 * ,----------------------------------------------------------------------------------.
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * |------+------+------+------+------+-------------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * |------+------+------+------+------+------|------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |      |      |      |      |      |      |      |      |      |
 * `-----------------------------------------------------------------------------------'
 */
// [_FUNCTION] = {
//   {_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______},
//   {_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______},
//   {_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______},
//   {_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______}
// },
